# WoodLatecolorPerlinEnable Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedWood..::..WoodLatecolorPerlinEnable Property
AdvancedWood Class See Also
---
The property labeled "Use perlin noise for latewood color" from the "AdvancedWood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WoodLatecolorPerlinEnable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WoodLatecolorPerlinEnable As String
	Get
```

Visual C++
---
```text
public:
static property String^ WoodLatecolorPerlinEnable {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyBoolean".
# See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace